Courses/7140/Lectures/Examples/spec-design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Famous Examples of Spec/Design</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Famous Examples of Spec/Design"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-10-01T00:34-0400"/>
<meta name="author" content="Prabhaker Mateti"/>
<meta name="description" content="CS7140 Software Engineering Lecture"/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../Lectures"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div>

<div id="preamble">
<a href="http://cecs.wright.edu/~pmateti/Courses/7140/">CS 7140 Advanced Software Engineering</a>
</div>

<div id="content">
<h1 class="title">Famous Examples of Spec/Design</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Examples of Spec/Design</h2>
<div class="outline-text-2" id="text-1">

<ol>
<li>Others and Bertrand Meyer, "How Specifications Change and Why You
   Should Care" <a href="http://arxiv.org/pdf/1211.4775v2.pdf">PDF</a> Jan 2013. Required Reading.
</li>
<li>In our lectures so far
<ol>
<li>Telegram
</li>
<li>Tabulate Equations
</li>
<li>Condense the List of Numbers
</li>
<li>pretty printing
</li>
<li>Worms
</li>
</ol>

</li>
<li>Knuth's Common Words Problem
</li>
</ol>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> JavaCard</h2>
<div class="outline-text-2" id="text-2">

<ol>
<li>JavaCard is a subset of Java chosen for small memory, weak-CPU, embedded
   devices.  Widely used in SIM cards and ATM cards.
</li>
<li><a href="http://code.google.com/p/jcml/">http://code.google.com/p/jcml/</a>  Java Card Specification Language based on JML
</li>
<li><a href="http://www.javacardforum.org/">http://www.javacardforum.org/</a>
</li>
<li>Erik Poll, Joachim van den Berg, Bart Jacobs, 
   "Specification of the JavaCard API in JML"
   <a href="http://cs.ru.nl/E.Poll/papers/cardis00.pdf">http://cs.ru.nl/E.Poll/papers/cardis00.pdf</a>  Recommended Reading.
</li>
<li>Nestor Catano, Tim Wahls, "Executing JML Specifications of Java
   Card Applications: A Case Study", search for PDF Link, 2009.
   Recommended Reading
</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Knuth's Common Words Problem</h2>
<div class="outline-text-2" id="text-3">

<ol>
<li>"Given a file of text, and a number k, print the k most common words."
</li>
<li>Used as an example of Literate Programming
</li>
<li>Criticized as an example of software development
</li>
<li>Our interest here:  How to describe its spec + design?
</li>
<li>Defs of text, words, &hellip;
</li>
<li>Def of "common" word
</li>
<li>nary Tries, &hellip;
</li>
<li>Destructive Traversals
</li>
<li>Donald E. Knuth, "A Solution to the Common Words Problem",
   Communications of the ACM, 1986, search for PDF link.  Knuth is a
   Turing Award winner. Required Reading.
</li>
<li><a href="../CWP/cwp.html">../CWP/cwp.html</a>
</li>
</ol>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Knuth, Donald E. "TEX: The Program"</h2>
<div class="outline-text-2" id="text-4">


<ol>
<li>Knuth, Donald E. "TEX: The Program", Volume B of Computers and
   typesetting. (1986). 624 pages, Addison-Wesley Professional;
   ISBN-10: 0201134373 One and onle one review on Amazon.com: This
   book is extremely valuable to those hoping to understand and reuse
   Knuth's classic typesetting algorithms. It contains the every
   detail needed for the implementation. Each section has a number
   associated with the source code. Besides, it can also serve as an
   excellent example of a large project for computer science
   students. One can understand better "the art of computer
   programming" after reading this book. … Recommended Reading ;-)
</li>
</ol>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> A Specification Schema For Indenting Programs</h2>
<div class="outline-text-2" id="text-5">


<ol>
<li>Prabhaker Mateti†, Article first published online: 27 OCT 2006
   <a href="http://onlinelibrary.wiley.com/doi/10.1002/spe.4380130206/abstract">http://onlinelibrary.wiley.com/doi/10.1002/spe.4380130206/abstract</a>
   Abstract A two level specification of the functional behaviour of a
   class of indenting programs for Pascal is presented. The
   transformation that these programs perform on the input text is a
   composition of splitting input lines, altering the blank space
   between lexical tokens and computing the margin required in front
   of each of the split lines. The high level specification is given
   as a stylized Pascal grammar in Extended BNF. In contrast, the low
   level specifications, which are operationally closer to a program,
   and which define how syntactically invalid text is dealt with,
   require several mathematical functions that capture the essence of
   these basic transformations. The specifications of an indenting
   program for Pascal are then obtained as a further elaboration of
   these functions. Most indentation styles appearing in the
   literature can be specified with precision using methods developed
   in this paper. Our experience in this case study indicates that
   although specifications for real-life programs can be given using
   simple mathematics, the effort required is still considerable.
</li>
</ol>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">


<ol>
<li>Others and Bertrand Meyer, "How Specifications Change and Why You
   Should Care" <a href="http://arxiv.org/pdf/1211.4775v2.pdf">PDF</a> Jan 2013. Required Reading.

</li>
<li>Donald E. Knuth, "A Solution to the Common Words Problem",
   Communications of the ACM, 1986, search for PDF link.  Knuth is a
   Turing Award winner. Required Reading.
</li>
</ol>

</div>
</div>
</div>

<div id="postamble">
<hr size=1>Copyright &copy; 2013 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a>
</div>
</body>
</html>
